# BeamDirectionNotSpecifiedError Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SketchFailures..::..BeamDirectionNotSpecifiedError Property
BuiltInFailures..::..SketchFailures Class See Also
---
Beam direction not specified.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId BeamDirectionNotSpecifiedError { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BeamDirectionNotSpecifiedError As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ BeamDirectionNotSpecifiedError {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SketchFailures Class
Autodesk.Revit.DB Namespace